/*******************************************************************************
* タイトル:		メインヘッダーファイル
* プログラム名:	main.h
* 作成者:		クラス記号 出席番号 氏名
* 作成日:		2018/04/16
*******************************************************************************/
#ifndef ENEMY_H
#define ENEMY_H


/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	char name[NAME_MAX];  //名前
	char jobname[NAME_MAX];    //職業
	int HP;       //体力
	int MP;       //マジックポイント
	int ATK;        //攻撃力
	int DEF;        //防御力
	int EXP;        //経験値
	int LV;         //レベル　
	int LVEXP;      //レベルアップ経験値
	int MAXHP;      //体力の上限
	int MAXATK;     //攻撃力の上限
	int fx;
	int fy;
	int eno;

}ENEMY;




/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
void UninitEnemy(void);
ENEMY *GetEnemyAdr(int eno);


#endif