/*******************************************************************************
* タイトル:		メインプログラム
* プログラム名:	main.cpp
* 作成者:		クラス記号 出席番号 氏名
* 作成日:		2018/04/16
*******************************************************************************/


/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "bukiya.h"
#include "title.h"
#include "tuto.h"
#include "player.h"
#include "enemy.h"
#include "worldmap.h"
#include "town.h"
#include "map.h"
#include "map1.h"
#include "map2.h"
#include "map3.h"
#include "map4.h"
#include "file.h"
#include "battle.h"
#include "end.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/



/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

	

/*******************************************************************************
* グローバル変数
*******************************************************************************/



/*******************************************************************************
 関数名:	int main( void )
 引数:	void
 戻り値:	正常終了: int型の 0
 説明:	メイン関数
*******************************************************************************/
int main(void)
{
	PLAYER *player = GetPlayerAdr(0);
	srand((unsigned)time(NULL));
	int flag = 1;
	//InitArrow();
	// 
	//UpdateTitle();

	//DrawEnd();

	DrawTitle();

	DrawTuto();

	InitPlayer();               //プレイヤーの初期化処理
	InitEnemy();                //エネミーの初期化処理
	/*DrawBattle();*/
	
	
	//while (1)
	//{
	//	// 何かキー入力があったら処理を行う
	//	if (_kbhit())
	//	{
	//		UpdateArrow();          //arrowの描画処理

	//		DrawArrow();
	//		DrawTitle();
	//	}

	//	/* 処理速度調整 */
	//	Sleep(100);
	//}

	// ゲームループ開始
	while (1)
	{


		// 何かキー入力があったら処理を行う
		if (_kbhit())
		{
			// 各種更新処理
			UpdatePlayer();		// プレイヤーの更新処理
			UpdateEnemy();		// エネミーの更新処理

			// 各種描画処理
			DrawPlayer();		// プレイヤーを描画する為に位置をセット
			DrawEnemy();		// エネミーを描画する為に位置をセット

			if (player->flag == 1)
			{
				DrawTown();
			}
			else if (player->flag == 2)
			{
				DrawBukiya();
			}
			else
			{
				switch (player->LV)
				{
				case 0:
					/*DrawWorldMap();*/
					DrawWorldMap();
					break;
				case 1:
					DrawMap();
					break;
				case 2:
					DrawMap1();
					break;
				case 3:
					DrawMap2();
					break;
				case 4:
					DrawMap3();
					break;
				default:
					DrawMap4();
					break;
				}
			}
			

		}

		

		/* 処理速度調整 */
		Sleep(100);
	}
	             
	

	// キー入力待ち
	rewind(stdin);
	_getch();
	


	/* 終了 */
	return 0;
}