/*******************************************************************************
* タイトル:		メインヘッダーファイル
* プログラム名:	main.h
* 作成者:		クラス記号 出席番号 氏名
* 作成日:		2018/04/16
*******************************************************************************/
#ifndef	MAIN_H
#define	MAIN_H

/*******************************************************************************
* scanf のwarning防止
*******************************************************************************/
#define _CRT_SECURE_NO_WARNINGS

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>
#include <time.h>
#include <conio.h>
#include <Windows.h>
/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define TATE_MAX	(24)	// 高さ
#define YOKO_MAX	(80)	// 横幅
#define YOKO_BAT    (66)    //バトル画面横幅
#define TATE_BAT    (14)	//バトル画面高さ
#define YOKO_T      (18)
#define TATE_Y      (71)
#define FH_MAX      (24)    //縦幅
#define FW_MAX      (80)    //横幅
#define GAMEN_MAX	(21)		// 4パターン画面
#define LOOP_CNT	(5)		// 5回繰り返す

#define NAME_MAX    (9)
#define ENEMY_MAX   (5)
#define PLAYER_MAX (4)
#define JOB_MAX    (4)
#define ARROW_Y    (14)
#define ARROW_X    (18)
/*******************************************************************************
* 構造体定義
*******************************************************************************/

typedef struct
{
	int HP;       //体力
	int MP;       //マジックポイント
	char name[NAME_MAX];  //名前
	char jobname[NAME_MAX];    //職業
	int ATK;        //攻撃力
	int DEF;        //防御力
	int EXP;        //経験値
	int LV;         //レベル　
	int LVEXP;      //レベルアップ経験値
	int MAXHP;      //体力の上限
	int MAXATK;     //攻撃力の上限
}CHARACTER;




/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
char *GetMapAdr(int y, int x);

#endif
