/*******************************************************************************
* タイトル:		メインヘッダーファイル
* プログラム名:	main.h
* 作成者:		クラス記号 出席番号 氏名
* 作成日:		2018/04/16
*******************************************************************************/
#ifndef PLAYER_H
#define PLAYER_H


/*******************************************************************************
* マクロ定義
*******************************************************************************/




/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	char name[NAME_MAX];  //名前
	char jobname[NAME_MAX];    //職業
	char sname1[NAME_MAX];    //スキルの名前
	char sname2[NAME_MAX];    //スキルの名前
	char sname3[NAME_MAX];    //スキルの名前
	int HP;         //体力
	int BEFHP;		//LVUP前の体力
	int MP;         //マジックポイント
	int s1MP;
	int s2MP;
	int s3MP;
	int BEFMP;		//LVUP前のマジックポイント
	int ATK;        //攻撃力
	int SATK1;      //スキル１攻撃力
	int SATK2;      //スキル２攻撃力
	int SATK3;      //スキル３攻撃力
	int DEF;        //防御力
	int EXP;        //経験値
	int LV;         //レベル　
	int BEFLV;		//レベルアップ前のレベル
	int LVEXP;      //レベルアップ経験値
	int MAXHP;      //体力の上限
	int MAXMP;		//MPの上限
	int MAXATK;     //攻撃力の上限
	int MAXDEF;		//防御力の上限
	int flag;		//playerの判断
	int fx;
	int fy;

}PLAYER;




/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);
PLAYER *GetPlayerAdr(int pno);

#endif